listOfSimpleNumbers = [17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79,
                       83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167,
                       173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263,
                       269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367,
                       373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463,
                       467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587,
                       593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683,
                       691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811,
                       821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929,
                       937, 941, 947, 953, 967, 971, 977, 983, 991, 997]

tinylistOfSimpleNumbers = [17, 19, 23, 29, 31, 37, 41, 43, ]


def Encode1251Char(c):
    out = []
    for i in range(len(c)):
        b = c[i].encode('windows-1251')
        out.append(int.from_bytes(b, "big"))
    return out


def Decode1251Char(c):
    s = bytes(c)
    s = s.decode('windows-1251').encode('utf-8').decode('utf-8')
    return s


def EncodeToAlph(c):
    for i in range(len(c)):
        if 32 <= c[i] <= 47:
            c[i] += 2
        if 192 <= c[i] < 198:
            c[i] -= 191
        elif c[i] == 168:
            c[i] = 7
        elif c[i] >= 198:
            c[i] -= 190
    return c

def DecodeFromAlph(c):
    for j in range(len(c)):
        if 34 <= c[j] <= 49:
            c[j] -= 2
            continue
        if c[j] == 7:
            c[j] = 168
            continue
        if c[j] < 8:
            c[j] += 191
            continue
        elif c[j] > 7:
            c[j] += 190
            continue
    return c

print("Эль-Гамаль усовершенствовал систему Диффи-Хеллмана и получил два алгоритма".upper())

print(len("ЭЛЬ-ГАМАЛЬ УСОВЕРШЕНСТВОВАЛ СИСТЕМУ ДИФФИ-ХЕЛЛМАНА И ПОЛУЧИЛ ДВА АЛГОРИТМА"))